/*
 * Copyright 2021 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

rule ttp_logDeletion {
  meta:
    // Routine log rotation can be a normal occurrence and is not in itself
    // malicious however it can also signal the presence of an attacker
    // attempting to clean up their activity.
    //
    // This rule triggers on the presence of a log deletion GCP audit event.
    //
    // Known False Positives:
    //    Routine log rotation functions, to address these consider adding
    //    an allow condition for known sources including principal.ip of trusted
    //    log hosts.
    //
    author = "Google Cloud Security"
    date = "2021-09-30"
    tactic = "TA0005"
    tags = "behavior"
    technique = "T1070.002"
    description = "Deletion of Cloud Audit Logs."
    reference = "https://attack.mitre.org/techniques/T1070/002/"

  events:
    $gcp.metadata.product_event_type = "google.logging.v2.LoggingServiceV2.DeleteLog"
    $gcp.principal.user.attribute.permissions.name = "logging.logs.delete"
    $gcp.principal.user.attribute.permissions.type = "ADMIN_WRITE"
    $gcp.target.application = "logging.googleapis.com"

  condition:
    $gcp
}

