rule office_applications_suspicious_process_activity {
 meta:
    author = "Osman Demir"
    description = "Detects office applications suspicious process activity  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/a6DA73rJ25vj"
    version = "0.01"
    created = "2021-03-09"
    product = "windows"
    service = "sysmon"

  events:
($selection.metadata.product_event_type = "1" and ($selection.principal.process.file.full_path = "excel.exe" or $selection.principal.process.file.full_path = "msaccess.exe" or $selection.principal.process.file.full_path = "outlook.exe" or $selection.principal.process.file.full_path = "powerpnt.exe" or $selection.principal.process.file.full_path = "winword.exe") and ($selection.target.process.file.full_path = "powershell.exe" or $selection.target.process.file.full_path = "cmd.exe"))

  condition:
    $selection
}
