rule net_ipc_share_sysmon {
 meta:
    author = "Michael Haag, Alexandr Yampolskyi"
    description = "Detects net usage accessing IPC$.  License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md."
    reference = "https://tdm.socprime.com/tdm/info/w9Hn8H98uk1g"
    version = "0.01"
    created = "2021-03-09"
    product = "windows"
    service = "sysmon"
    mitre = "Execution, t1204, 1059"

  events:
($selection.metadata.product_event_type = "1" and $selection.target.process.file.full_path = "net.exe" and re.regex($selection.target.process.command_line, `.*ipc$.*`))

  condition:
    $selection
}
