/*
 * Copyright 2021 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     https://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

rule mitre_attack_T1564_001_macos_hidden_files_and_directories
{
  meta:
    author = "Google Cloud Security"
    description = "Manually setting a file or a directory to be hidden on macOS"
    reference = "https://attack.mitre.org/techniques/T1564/001/"
    yara_version = "YL2.0"
    rule_version = "1.0"

  events:
    (
      $e1.metadata.event_type = "PROCESS_LAUNCH" and
      (
        re.regex($e1.principal.process.command_line, `setfile -a V`) or
        re.regex($e1.principal.process.command_line, `chflags hidden`)
      )
    )
    or
    (
      $e1.metadata.event_type = "FILE_MODIFICATION" and
      re.regex($e1.target.file.full_path, `^\.`)
    )

  condition:
    $e1
}
